Tekla Open API Reference for Tekla Structures 2025
Vector Constructor
Overload List
Name | Description
Vector()
 Instantiates a zero length vector.
Vector(Point)
 Instatiates a new vector with the given point.
Vector(Double, Double, Double)
 Instantiates a vector with the given coordinates.
Top
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace